OS-Q/A21/boards.txt
GenF4.name=Generic STM32F4 series

GenF4.build.vid=0x0483
GenF4.build.core=arduino
GenF4.build.board=GenF4
GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF4.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.build.series=STM32F4xx
GenF4.build.cmsis_lib_gcc=arm_cortexM4l_math

# Black F407VE
GenF4.menu.pnum.BLACK_F407VE=Black F407VE
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VE.build.board=BLACK_F407VE
GenF4.menu.pnum.BLACK_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VE.build.variant=BLACK_F407XX

# Black F407VG
GenF4.menu.pnum.BLACK_F407VG=Black F407VG
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VG.build.board=BLACK_F407VG
GenF4.menu.pnum.BLACK_F407VG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VG.build.variant=BLACK_F407XX

# Black F407ZE
GenF4.menu.pnum.BLACK_F407ZE=Black F407ZE
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZE.build.board=BLACK_F407ZE
GenF4.menu.pnum.BLACK_F407ZE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZE.build.variant=BLACK_F407XX

# Black F407ZG
GenF4.menu.pnum.BLACK_F407ZG=Black F407ZG
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZG.build.board=BLACK_F407ZG
GenF4.menu.pnum.BLACK_F407ZG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZG.build.variant=BLACK_F407XX

# Blue F407VE mini: http://wiki.stm32duino.com/index.php?title=Vcc-gnd.com_STM32F407VET6_Mini
GenF4.menu.pnum.BLUE_F407VE_Mini=Blue F407VE mini
GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_size=524288
GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_data_size=131072
GenF4.menu.pnum.BLUE_F407VE_Mini.build.board=BLUE_F407VE_Mini
GenF4.menu.pnum.BLUE_F407VE_Mini.build.product_line=STM32F407xx
GenF4.menu.pnum.BLUE_F407VE_Mini.build.variant=BLUE_F407VE_Mini

# DIYMROE STM32F407VGT board
GenF4.menu.pnum.DIYMROE_F407VGT=DIYMROE STM32F407VGT
GenF4.menu.pnum.DIYMROE_F407VGT.upload.maximum_size=1048576
GenF4.menu.pnum.DIYMROE_F407VGT.upload.maximum_data_size=131072
GenF4.menu.pnum.DIYMROE_F407VGT.build.board=DIYMROE_F407VGT
GenF4.menu.pnum.DIYMROE_F407VGT.build.product_line=STM32F407xx
GenF4.menu.pnum.DIYMROE_F407VGT.build.variant=DIYMROE_F407VGT

# FK407M1
GenF4.menu.pnum.FK407M1=FK407M1 STM32F407VET
GenF4.menu.pnum.FK407M1.upload.maximum_size=524288
GenF4.menu.pnum.FK407M1.upload.maximum_data_size=131072
GenF4.menu.pnum.FK407M1.build.board=FK407M1
GenF4.menu.pnum.FK407M1.build.product_line=STM32F407xx
GenF4.menu.pnum.FK407M1.build.variant=FK407M1

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=-g
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=-g
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}                                                                                                        

###############################
# Sparky Flight Controllers

Sparky.name=Sparky flight controllers

Sparky.build.vid=0x0483
Sparky.build.core=arduino
Sparky.build.board=Sparky
Sparky.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Sparky_V1 board
Sparky.menu.pnum.Sparky_V1=Sparky V1
Sparky.menu.pnum.Sparky_V1.upload.maximum_size=262144
Sparky.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
Sparky.menu.pnum.Sparky_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Sparky.menu.pnum.Sparky_V1.build.board=Sparky_V1
Sparky.menu.pnum.Sparky_V1.build.series=STM32F3xx
Sparky.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
Sparky.menu.pnum.Sparky_V1.build.variant=SPARKY_F303CC
Sparky.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Sparky.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Sparky.menu.upload_method.swdMethod.upload.protocol=0
Sparky.menu.upload_method.swdMethod.upload.options=-g
Sparky.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Sparky.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Sparky.menu.upload_method.serialMethod.upload.protocol=1
Sparky.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Sparky.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Sparky.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Sparky.menu.upload_method.dfuMethod.upload.protocol=2
Sparky.menu.upload_method.dfuMethod.upload.options=-g
Sparky.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# RAK boards

RAK.name=RAKWireless

RAK.build.vid=0x0483
RAK.build.core=arduino
RAK.build.board=RAK
RAK.build.mcu=cortex-m3
RAK.build.series=STM32L1xx
RAK.build.cmsis_lib_gcc=arm_cortexM3l_math
RAK.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# RAK811_TRACKER board
RAK.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
RAK.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
RAK.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
RAK.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
RAK.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
RAK.menu.pnum.RAK811_TRACKER.build.variant=RAK811_TRACKER

