OS-Q/A21/boards.txt
Sparky.menu.rtlib.nano=Newlib Nano (default)
Sparky.menu.rtlib.nanofp=Newlib Nano + Float Printf
Sparky.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Sparky.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Sparky.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Sparky.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Sparky.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Sparky.menu.rtlib.full=Newlib Standard
Sparky.menu.rtlib.full.build.flags.ldspecs=

RAK.menu.rtlib.nano=Newlib Nano (default)
RAK.menu.rtlib.nanofp=Newlib Nano + Float Printf
RAK.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
RAK.menu.rtlib.nanofs=Newlib Nano + Float Scanf
RAK.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
RAK.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
RAK.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
RAK.menu.rtlib.full=Newlib Standard
RAK.menu.rtlib.full.build.flags.ldspecs=

3dprinter.menu.rtlib.nano=Newlib Nano (default)
3dprinter.menu.rtlib.nanofp=Newlib Nano + Float Printf
3dprinter.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
3dprinter.menu.rtlib.nanofs=Newlib Nano + Float Scanf
3dprinter.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
3dprinter.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
3dprinter.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
3dprinter.menu.rtlib.full=Newlib Standard
3dprinter.menu.rtlib.full.build.flags.ldspecs=
